{"Items": [{"ItemID": "1043374545", "Name": "christopher radko &#124; fritz n_ frosty sledding", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Christopher Radko"], "Currently": "$30.00", "First_Bid": "$30.00", "Number_of_Bids": "0", "Bids": null, "Location": "its a dry heat", "Country": "USA", "Started": "Dec-03-01 18:10:40", "Ends": "Dec-13-01 18:10:40", "Seller": {"UserID": "rulabula", "Rating": "1035"}, "Description": "brand new beautiful handmade european blown glass ornament from christopher radko. this particular ornament features a snowman paired with a little girl bundled up in here pale blue coat sledding along on a silver and blue sled filled with packages. the ornament is approximately 5_ tall and 4_ wide. brand new and never displayed, it is in its clear plastic packaging and comes in the signature black radko gift box. PLEASE READ CAREFULLY!!!! payment by cashier's check, money order, or personal check. personal checks must clear before shipping. the hold period will be a minimum of 14 days. I ship with UPS and the buyer is responsible for shipping charges. the shipping rate is dependent on both the weight of the package and the distance that package will travel. the minimum shipping/handling charge is $6 and will increase with distance and weight. shipment will occur within 2 to 5 days after the deposit of funds. a $2 surcharge will apply for all USPS shipments if you cannot have or do not want ups service. If you are in need of rush shipping, please let me know and I_will furnish quotes on availability. the BUY-IT-NOW price includes free domestic shipping (international winners and residents of alaska and hawaii receive a credit of like value applied towards their total) and, as an added convenience, you can pay with paypal if you utilize the feature. paypal is not accepted if you win the auction during the course of the regular bidding-I only accept paypal if the buy it now feature is utilized. thank you for your understanding and good luck! Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1043397459", "Name": "PM BOY AND GIRL EXCLUSIVE EVENT PIECE LE", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Enesco", "Precious Moments"], "Currently": "$99.99", "First_Bid": "$99.99", "Number_of_Bids": "0", "Bids": null, "Location": "LONG ISLAND USA", "Country": "USA", "Started": "Dec-03-01 18:38:23", "Ends": "Dec-13-01 18:38:23", "Seller": {"UserID": "dollface94", "Rating": "221"}, "Description": "YOU ARE ALWAYS IN MY HEART IS THE NAME OF IT ,HAS A BOY AND A GIRL EACH SITTING IN A HEART SHAPED SHELL ON A BENCH THESE PIECES ARE RARE AND EXCLUSIVE YOU GET BOTH PIECES IN YOUR BID THEY ARE MINT NEVER BEEN DISPLAYED BRAND NEW IN BOXES .... ALSO TAKE PAYPALBUYER PAYS 8.00 SHIPPING"}, {"ItemID": "1043402767", "Name": "Precious Moments Girl Stove Mini Tea Set", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Enesco", "Precious Moments"], "Currently": "$4.00", "First_Bid": "$4.00", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "goldcoastvideo", "Rating": "2919", "Location": "Los Angeles,CA", "Country": "USA"}, "Time": "Dec-06-01 06:44:54", "Amount": "$4.00"}}], "Location": "MIlwaukee Wi", "Country": "USA", "Started": "Dec-03-01 18:44:54", "Ends": "Dec-13-01 18:44:54", "Seller": {"UserID": "fallsantiques", "Rating": "952"}, "Description": "PRECIOUS MOMENTS GIRL/STOVE MINI TEA SET: This really cute little mini decorative teaset is mint in box. It was only removed for photo. It is about 6 inches across. Original price was $20.00. Buyer to pay postage and handling of $4.50 for delivery in USA."}, {"ItemID": "1043402785", "Name": "Beatrix Potter Tailor of Gloucester Shakers", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Enesco", "Other Enesco Items"], "Currently": "$3.50", "First_Bid": "$3.50", "Number_of_Bids": "0", "Bids": null, "Location": "MIlwaukee Wi", "Country": "USA", "Started": "Dec-03-01 18:44:55", "Ends": "Dec-13-01 18:44:55", "Seller": {"UserID": "fallsantiques", "Rating": "952"}, "Description": "BEATRIX POTTER TAILOR OF GLOUSCESTER SHAKERS: Really cute set of figural salt and pepper shakers of the mouse tailor and two spools of thread. It is mint in box. Original price was $15.00. Buyer to pay postage and handling of $4.50 for delivery in USA."}, {"ItemID": "1043495702", "Name": "Precious Moments Fig-ANGEL OF MERCY- NURSE", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Enesco", "Precious Moments"], "Currently": "$28.00", "First_Bid": "$9.99", "Number_of_Bids": "6", "Bids": [{"Bid": {"Bidder": {"UserID": "nobody138", "Rating": "427", "Location": "GOD BLESS AMERICA, FROM SOUTH, MS", "Country": "USA"}, "Time": "Dec-04-01 23:20:07", "Amount": "$12.99"}}, {"Bid": {"Bidder": {"UserID": "danielhb2000", "Rating": "1", "Location": "Huntington Beach, Ca.", "Country": "USA"}, "Time": "Dec-06-01 02:00:07", "Amount": "$15.99"}}, {"Bid": {"Bidder": {"UserID": "boncon123", "Rating": "106", "Location": "Northern Ireland", "Country": "United Kingdom"}, "Time": "Dec-07-01 04:40:07", "Amount": "$18.99"}}, {"Bid": {"Bidder": {"UserID": "watchdenmark", "Rating": "37", "Location": "Munich", "Country": "Germany"}, "Time": "Dec-08-01 07:20:07", "Amount": "$22.00"}}, {"Bid": {"Bidder": {"UserID": "mrwvh", "Rating": "92", "Location": "Bryan, TX", "Country": "USA"}, "Time": "Dec-09-01 10:00:07", "Amount": "$25.00"}}, {"Bid": {"Bidder": {"UserID": "allyw1", "Rating": "15", "Location": "New York", "Country": "USA"}, "Time": "Dec-10-01 12:40:07", "Amount": "$28.00"}}], "Location": "Missouri The Show Me State", "Country": "USA", "Started": "Dec-03-01 20:40:07", "Ends": "Dec-13-01 20:40:07", "Seller": {"UserID": "lwm123", "Rating": "813"}, "Description": "Precious Moments Fig-ANGEL OF MERCY- NURSE Click picture to enlarge Makes a great gift for Collectors Description Up for bids is this great figurine from Precious Moments. It is #102482, ANGEL OF MERCY. It is a 5 1/2 inch figurine of an angel nurse. She is carrying a plant. It is really cute, just look at the pictures. It was released in 1986. This figurine bears the FIRST production mark of the Olive Branch. It is in EXCELLENT condition. It has only been displayed in a glass case and comes in its original box with all production tags included. The bidding starts at $9.99 with NO RESERVE!!! THANK YOU FOR LOOKING AND HAPPY BIDDING!!!!!!!!!!!!!! US Shipping is $5.60 for Priority Mail with tracking. International shipping, including Canada, is different depending on destination. International bidders, including Canada, must pay through Pay Pal or in US Cash. Email with any questions. Insurance, if desired, is extra. 0-$50.=1.10 - $51.-$100.=$2.00 -$101.-$200.=$3.00 - $201 - $250.=$4.00. Winning bidder must make contact within 3 days and payment must be received witin 10 days (21 days for international winners) or Ebay will be contacted and item relisted. If you don't intend to complete the transaction, Please Don't Bid. Details Click picture to enlarge Condition Excellent This item is in EXCELLENT condition it has only been displayed in a glass case. It comes in its original box with all production tags included!!!!! Payment and Shipping Info Payment Options Money Order/Cashier's Check or Personal Check _ _ _ Shipping Fixed Shipping Charges.$5.60 (Domestic) Will Ship Internationally Quantity Available 1 Special! PLEASE CLICK THE LINK BELOW TO VIEW MY OTHER ITEMS. It Shows ALL My Auctions!!!...I have many quality Precious Moments Figurines and Dolls up for bids with values up to $250.00....ALL with starting bids of $9.99 or less and ALL with NO RESERVE!!!...CHECK THEM OUT!!!!!.... Combine auctions and SAVE on shipping!!!...I accept Pay Pal, Money Orders and Personal Checks. Please note there is 10 day hold on shipping till Personal Checks clear. Click picture to enlarge _ Click picture to enlarge _ Click picture to enlarge _ Click picture to enlarge _ Click picture to enlarge _ Use the REAL selling tools a million sellers do - Andale!"}, {"ItemID": "1043506302", "Name": "DREAMSICLES suncatcher \"LOVE LETTERS\" new/nr", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Dreamsicles"], "Currently": "$6.00", "First_Bid": "$6.00", "Number_of_Bids": "0", "Bids": null, "Location": "ga", "Country": "USA", "Started": "Dec-03-01 20:59:45", "Ends": "Dec-13-01 20:59:45", "Seller": {"UserID": "dmaley", "Rating": "8226"}, "Description": "DREAMSICLES suncatcher \"LOVE LETTERS\" new/nr Description LOVE LETTERS ! AWARD-WINNING ARTIST KRISTIN HAYNES SHARES HER HEARTWARMING, INSPIRATIONAL ARTISTRY IN THIS EXQUISITE SUNCATCHER PERFECT FOR ANY SUNNY WINDOW! A CHARMING PAIR OF CHERUBS IS ENCIRCLED BY A FLORAL BORDER AND FRAMED IN BRASS. . FRAMED IN BRASS ACCENTED WITH HEARTS. 8\" LONG INCLUDING CHAIN. NEW/MINT/BOX Winning bidder, click here to pay instantly with PayPal! Payment and Shipping I ACCEPT MASTER CARD, VISA, DISCOVER THROUGH PAYPAL, BILLPOINT. CHECKS (with clearance before shipping) money orders, cashiers cks as well. Buyer to prepay in US funds and include $4.00 for shipping and handling within the US only. I SHIP WORLDWIDE ACCEPTING ONLY US FUNDS, PLEASE INQUIRE ABOUT SHIPPING COSTS. IF YOU ARE IN CANADA, INQUIRE BEFORE PAYING ABOUT POSTAGE. ONLY U.S. FUNDS ACCEPTED FOR CANADA. BIDDER IS RESPONSIBLE FOR SHIPPING AND HANDLING CHARGES IMPORTANT! WHAT TO DO WHEN THE AUCTION ENDS? 1. Winning bidder will receive a email notification from dmaley@alltel.net automatically within a few hours after the auction ends. 2. If paying by check or moneyorder please include description,item # or send copy of winner notice to insure quick shipment. ALL MERCHANDISE IS GUARANTEED 100% eBay's most successful sellers use Auctionworks sales management services!"}, {"ItemID": "1043562035", "Name": "Town Crier CD102", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Dreamsicles"], "Currently": "$15.00", "First_Bid": "$15.00", "Number_of_Bids": "0", "Bids": null, "Location": "Cleveland,OH", "Country": "USA", "Started": "Dec-04-01 03:09:56", "Ends": "Dec-14-01 03:09:56", "Seller": {"UserID": "sharkbud", "Rating": "5"}, "Description": "Dreamsicle Club Members Only Figurine 1995 4 1/2\" Issued:1995 * Retired:1995 This piece is in mint condition and in the original box. Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1043565691", "Name": "Hertz Corporation Bond Certificate 1970's", "Category": ["Collectibles", "Autographs, Paper & Writing", "Paper", "Ephemera"], "Currently": "$24.95", "First_Bid": "$24.95", "Number_of_Bids": "0", "Bids": null, "Location": "Bob.com, Virginia", "Country": "USA", "Started": "Dec-04-01 04:02:04", "Ends": "Dec-14-01 04:02:04", "Seller": {"UserID": "scripophily.com", "Rating": "2038"}, "Description": "Scripophily Makes a Great Gift for Everyone Our Stocks are worth the paper they're printed on (sm) Our Company is a TRUSTED Buyer and Seller of Old Stock Certificates. Check out our About Me Page , where you can find out about us and read the recent articles about our company in Time Magazine, The Wall Street Journal, The Globe and Mail, Washington Post and our appearence on CNN. Beautifully engraved certificate from the Hertz Corporation issued in 1976-1977. This historic document was printed by the Security-Columbian Banknote Company and has an ornate border around it with a vignette of an allegorical man and woman sitting beside the company's logo. This item has the printed signatures of the company_s chairman (Robert L. Stone) and vice-president,finance and assistant secretary. This bond is over 34 years old. Hertz, the world's leading vehicle renting organization, is represented in over 140 countries, operating a fleet of 525,000 vehicles from approximately 6,500 locations. The pioneer of auto renting was Walter L. Jacobs who in September of 1918, at the age of 22, opened a car-rental operation in Chicago. Starting with a dozen Model T Fords, which he repaired and repainted himself, Jacobs expanded his operation to the point where, within five years, the business generated annual revenues of about $1 million. In 1923, Jacobs sold his car-rental concern to John Hertz, President of Yellow Cab and Yellow Truck and Coach Manufacturing Company. Jacobs continued as Hertz' top operating and administrative executive. This rental business, called Hertz Drive-Ur-Self System, was acquired in 1926 by General Motors Corporation when it bought Yellow Truck from John Hertz. The Hertz Corporation In 1953, the Hertz properties were bought from GMC by the Omnibus Corporation, which divested itself of its bus interest and concentrated solely on car and truck renting and leasing. A year later, a new name was taken -- The Hertz Corporation -- and it was listed for the first time on the New York Stock Exchange. Jacobs became Hertz' first President and served in that post until his retirement in 1960. He died in 1985 at the age of 88. In 1954, the new corporation bought Metropolitan Distributors, a pioneer in New York truck leasing dating back to World War I and the largest concern of its kind in any one city. In the process, the head of Metropolitan, Leon C. Greenbaum, became Vice Chairman of the Hertz Board of Directors; he later became Chairman, and in 1960, Chief Executive Officer. In 1967, The Hertz Corporation became a wholly owned subsidiary of RCA Corporation and operated as a separate entity, with its own management and Board of Directors. In 1985, Hertz joined UAL, Inc. On December 30, 1987, Hertz was sold to Park Ridge Corporation, a company formed by Ford Motor Company and Hertz management, for the purpose of purchasing Hertz. In 1988, Volvo North America Corporation joined Ford and Hertz management as an investor in Park Ridge Corporation. In 1993, Park Ridge Corporation was merged into The Hertz Corporation. In 1994, Ford purchased the outstanding shares of Hertz and Hertz became an independent, wholly owned subsidiary of The Ford Motor Company. On April 25, 1997, Hertz became a publicly traded company, listed on the New York Stock Exchange, under the symbol \"HRZ.\" Hertz Today Hertz is headquartered in Park Ridge, New Jersey. Its current headquarters location opened in 1988. Prior to that the corporation was based in New York and, before that, Chicago. Oklahoma City, Oklahoma, is the site of Hertz' Worldwide Reservations Center and Data Center, established in 1970, and its Financial Center, established in 1994. Car rentals, the largest and best known of Hertz' activities, are conducted from more than 1,600 domestic, corporate and licensee locations, and approximately 4,500 corporate and licensee locations outside the United States. Hertz offers a wide variety of current-model cars on a short-term rental basis -- daily, weekly or monthly -- at airports, in downtown and suburban business centers, and in residential areas and resort locales. Today, Hertz' Worldwide Reservations System handles approximately 40 million phone calls and delivers in total approximately 30 million reservations annually This Authentic certificate looks great framed and is much nicer in person than the scan indicates. For further information about our auction item for sale, please click here or feel free to call our toll free number at 1-888-STOCKS6 or Direct at 703-787-3552. We sometimes use an image of the same type of certificate that is for sale. The certificate for sale will be the same in all material respects i.e. type, era, vignette, logo, etc. Don't stay awake suffering from Internet Auction ANGST , check out our Scripophily Auction Guarantee. We offer a 7 day no hassle satisfaction guarantee return policy in the event you are dissatisfied for any reason and a lifetime return policy if you find the item not to be authentic. To the best of our knowledge, everything we sell is 100% authentic and we do not sell reproductions of stock and bond certificates. There are not many companies who offer this type of guarantee in an auction. Our company has over 2,800 positive feedback comments on EBAY and we strive for 100% customer satisfaction. This will make a nice addition to your collection or a terrific historical gift for someone special. A $3.95 Priority Mail shipping charge(our cost in heavy cardboard envelope) to be paid by buyer for shipping within the United States. We will also ship anywhere in the world using Priority Mail and you will be charged our cost. If you buy other items from our auctions or web site, you only pay postage once if we mail everything together. We accept Visa, Mastercard, American Express, Paypal and Billpoint, checks and money orders. Please note that as with all of our certificates, we are not selling ownership interests or transferring any rights in the company, but we are selling an authentic stock certificate as a collectible. Our Company is a leader on the internet in buying, selling and researching collectible stock and bond certificates. We have been in business selling certificates for over 11 years. We are also members of The American Institute of Certified Public Accountants, Washington Historical Autograph and Certificate Organization, Old Stock Exchange, EBAY Power Seller Program, Universal Autographs Collectors Club, and The International Bond and Share Society. Our Company is a name you can Trust. Contact auctions@Scripophily.com with Questions View some of our feedback on Ebay CLICK HERE! View our other auctions currently on Ebay CLICK HERE!"}, {"ItemID": "1043608482", "Name": "Hallmark TIN Mail Truck Series", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Hallmark", "Miniature Ornaments"], "Currently": "$7.95", "Buy_Price": "$11.17", "First_Bid": "$7.95", "Number_of_Bids": "0", "Bids": null, "Location": "Check out my other Auctions and Save BIG", "Country": "USA", "Started": "Dec-04-01 08:10:20", "Ends": "Dec-14-01 08:10:20", "Seller": {"UserID": "gracie3@kc.rr.com", "Rating": "271"}, "Description": "This ornie is mint in mint box. It has never been displayed. It comes from a smoke free home. I charge $5.00 to ship Priority insured mail by USPS. I can usually ship as many as 3 ornies for the price of one. I accept Paypal, checks. and money orders. I ship the next day on Money orders and Paypal. If you have at least 10 Positive feedbacks with no negatives I do not hold your check for clearnace. Thanks for looking Gracie"}, {"ItemID": "1043650580", "Name": "Authentic Avon Quartz Silver/Gold Watch NIB", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Avon", "Other Avon Items"], "Currently": "$24.99", "First_Bid": "$24.99", "Number_of_Bids": "0", "Bids": null, "Location": "NY", "Country": "USA", "Started": "Dec-04-01 10:30:55", "Ends": "Dec-14-01 10:30:55", "Seller": {"UserID": "nikkinap", "Rating": "69"}, "Description": "This is new in the box bought for Avon representitives to wear. Made with high quality quartz movement which provides accuracy within seconds per month. Silver & gold adjustable band, gold face with \"Let's Talk Avon\", surrounded with diamonds around the face. 2000 Item, save & keep as a collectible for years to come! Ship $4, paypal/money orders ship same day, personal checks held 10 days. Buy it now & have in time for the holidays! Great gift to give your Avon Rep.! See my other auctions & combine sales to save on shipping. No PO Boxes. Must close in 10 days from auction end. Free Honesty Counters powered by Andale! Payment Details U.S. Shipping and Handling $4.00 Shipping Insurance per item (optional) $1.10 Sales Tax (0.000% if shipped to none) _ Learn more about checkout Payment Instructions &lt;!-- Begin PayPal Logo --&gt; &lt;A HREF="}, {"ItemID": "1043747228", "Name": "HANDBLOWN, ETCHED GLASS BRANDY SNIFTER", "Category": ["Collectibles", "Housewares & Kitchenware", "Barware", "Other Barware"], "Currently": "$19.95", "First_Bid": "$19.95", "Number_of_Bids": "0", "Bids": null, "Location": "Portland, Oregon", "Country": "USA", "Started": "Dec-04-01 14:29:34", "Ends": "Dec-14-01 14:29:34", "Seller": {"UserID": "browseandbuy", "Rating": "1314"}, "Description": "HANDBLOWN, ETCHED GLASS BRANDY SNIFTER. The sides are impressed in for easy holding. Bottom is white and pedestal is applied to glass. Glass is 6-1/2_ tall and base is 2_ tall and 3_ in diameter at bottom. The color of the glass is a smoky gray. This is a unique snifter with no damage at all in any way _ no chips, cracks, breaks, or hairlines. The etched glass design is wheat stalk. PLEASE SEE PHOTOS AND GOOD LUCK BIDDING! Shipping and handling includes shipping, packing and insurance. Money orders, cashier's checks, and personal checks accepted. If paying by personal check, item is held 7-10 days for check to clear before shipping. Payment is required within 10 days after end of auction. Remember: Not honoring your bid will result in negative feedback! Ruby Lane Antiques & Collectibles Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1043749860", "Name": "CGC 9.0 80 PAGE GIANT #8 SECRET ORIGINS VF/NM", "Category": ["Collectibles", "Pop Culture", "Comics", "Silver Age (1956-69)", "Horror, Sci-Fi"], "Currently": "$197.50", "First_Bid": "$0.99", "Number_of_Bids": "12", "Bids": [{"Bid": {"Bidder": {"UserID": "bbb1218", "Rating": "496", "Location": "USA", "Country": "USA"}, "Time": "Dec-05-01 06:36:30", "Amount": "$17.37"}}, {"Bid": {"Bidder": {"UserID": "littlelou", "Rating": "598", "Location": "East Coast!", "Country": "USA"}, "Time": "Dec-05-01 22:36:30", "Amount": "$33.74"}}, {"Bid": {"Bidder": {"UserID": "earthdeev", "Rating": "52", "Location": "San Francisco", "Country": "USA"}, "Time": "Dec-06-01 14:36:30", "Amount": "$50.12"}}, {"Bid": {"Bidder": {"UserID": "clovers-woodsedge", "Rating": "16", "Location": "ONLY TOWN, PA", "Country": "USA"}, "Time": "Dec-07-01 06:36:30", "Amount": "$66.49"}}, {"Bid": {"Bidder": {"UserID": "sabsmart", "Rating": "38", "Location": "SOUTH BEACH", "Country": "USA"}, "Time": "Dec-07-01 22:36:30", "Amount": "$82.87"}}, {"Bid": {"Bidder": {"UserID": "clothingbroker", "Rating": "686", "Location": "Orlando, FL", "Country": "USA"}, "Time": "Dec-08-01 14:36:30", "Amount": "$99.24"}}, {"Bid": {"Bidder": {"UserID": "surfingmarie", "Rating": "134", "Location": "North Carolina", "Country": "USA"}, "Time": "Dec-09-01 06:36:30", "Amount": "$115.62"}}, {"Bid": {"Bidder": {"UserID": "parker983", "Rating": "66", "Location": "VERY SEXY SKIRT", "Country": "USA"}, "Time": "Dec-09-01 22:36:30", "Amount": "$132.00"}}, {"Bid": {"Bidder": {"UserID": "tiff1519", "Rating": "21", "Location": "Cleveland, OH", "Country": "USA"}, "Time": "Dec-10-01 14:36:30", "Amount": "$148.37"}}, {"Bid": {"Bidder": {"UserID": "atomicplanet.net", "Rating": "1563", "Location": "AtomicPlanet.net", "Country": "USA"}, "Time": "Dec-11-01 06:36:30", "Amount": "$164.75"}}, {"Bid": {"Bidder": {"UserID": "mikekomm", "Rating": "758", "Location": "California", "Country": "USA"}, "Time": "Dec-11-01 22:36:30", "Amount": "$181.12"}}, {"Bid": {"Bidder": {"UserID": "kaelo", "Rating": "771", "Location": "Makawao - Maui", "Country": "USA"}, "Time": "Dec-12-01 14:36:30", "Amount": "$197.50"}}], "Location": "NJ,USA", "Country": "USA", "Started": "Dec-04-01 14:36:30", "Ends": "Dec-14-01 14:36:30", "Seller": {"UserID": "captwhiz", "Rating": "1054"}, "Description": "According to the CGC census their are only 3 higher graded copies of this book in the world. KILLER BOOK! One owner (CAPTWHIZ)! COMBINE SHIPPING! This comic book is graded VFN/NM 9.0 by CGC! Any waves, bends or flashes in the photos is just BAD photography. This is the BLUE LABEL which means NO RESTORATION!! NUFF SAID! The NM price is $450.00. SUPERFAST shipping only $3.95, international extra! PayPal accepted."}, {"ItemID": "1043817906", "Name": "NEVADA ghost town bottle digging book, 1961", "Category": ["Collectibles", "Housewares & Kitchenware", "Bottles: Antique (Pre-1900)", "Medicines, Cures"], "Currently": "$6.00", "First_Bid": "$6.00", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "mimiyaya", "Rating": "10", "Location": "Atlanta, Ga", "Country": "USA"}, "Time": "Dec-07-01 04:56:27", "Amount": "$6.00"}}], "Location": "Iowa", "Country": "USA", "Started": "Dec-04-01 16:56:27", "Ends": "Dec-14-01 16:56:27", "Seller": {"UserID": "tjsdsm", "Rating": "439"}, "Description": "GREAT BOOK from the early heyday of bottle digging. This 55 page book by Adele Reed describes visits to 12 Nevada ghost towns and 4 California ghost towns, a description of what remained of the town and the bottles they dug in each town. It is autographed by the author. The Nevada towns included Goldfield, Virginia city, Sutro, Aurora, Belleville, Teel's Marsh, Candelaria, Belmont, Manhattan, Eureka, Austin,& Tonopah and the California towns included Mammoth City, Big Pine, Blind Springs Hill, & Bodie. There are drawings of the bottles they found at each site and a drawing of one of the remaining buildings. It is a truely interesting book with a little history thrown in. The book is 8 1/2\" by 11\" and while used the only damage is some water spots, wear and dirt on the cover. Buyer pays $1.50 shipping and checks require 10 days to clear."}, {"ItemID": "1043899828", "Name": "PRECIOUS MOMENTS 15 HAPPY YEARS A TWEET BIRDS", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Enesco", "Precious Moments"], "Currently": "$19.90", "First_Bid": "$19.90", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "betteb", "Rating": "949", "Location": "ny", "Country": "USA"}, "Time": "Dec-07-01 06:35:48", "Amount": "$19.90"}}], "Location": "THE SHORES of LAKE ERIE ~~OH~~", "Country": "USA", "Started": "Dec-04-01 18:35:48", "Ends": "Dec-14-01 18:35:48", "Seller": {"UserID": "robray", "Rating": "2039"}, "Description": "15 HAPPY YEARS TOGETHER WHAT A TWEET! COMMEMORATIVE ANNUAL 1993 FIGURINE 1993 BUTTERFLY SYMBOL Figurine is 5.25_ tall by 8_ long. Bunnies listen as Angel leads BLUEBIRD Choir. A beauty of a figurine. This is the Commemorative Annual 1993 figurine _ Butterfly Symbol. Figurine is brand new in PRECIOUS MOMENTS purple box _ never used _ and comes with original hang tag, tent card and paperwork. ****ALSO included in this display is a 3_ button _ with clip on the back _ commemorating the 15 Happpy Years also _ very pretty _ looks just like the picture on the Precious Moments box. No chips, cracks or breaks - a perfect, mint Precious Moments........figurine...... BUYER to pay $8 shipping cost. Payment by PayPal, Bidpay, money order or cashier_s check. Personal check discouraged as I do hold for bank clearance. ~~THANKS FOR LOOKING~~ ~~NOTE ~~ LOW RESERVE~~ ~~PLEASE CHECK MY OTHER AUCTIONS~~ I accept payments from anyone with PayPal CLICK ON LOGO I accept payments from anyone with Bidpay CLICK ON LOGO Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1043930362", "Name": "~~~50~~~8.5x14.5 BUBBLE MAILERS #3~~BUY NOW!!", "Category": ["Collectibles", "Pop Culture", "Comics", "Modern Age (1980-Now)", "Alternative, Underground"], "Currently": "$11.99", "First_Bid": "$11.99", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "syl@inetdirect.net", "Rating": "468", "Location": "Indianapolis, IN", "Country": "USA"}, "Time": "Dec-07-01 06:40:32", "Amount": "$11.99"}}], "Location": "FLORIDA ~~~ 800-981-9064 ~~~8am - 10pm 7 days", "Country": "USA", "Started": "Dec-04-01 19:04:26", "Ends": "Dec-14-01 17:28:51", "Seller": {"UserID": "parrothead88", "Rating": "25430"}, "Description": "***SELF-SEALING*** *** BUBBLE MAILERS *** All text and photos in this ad are protected under Copyright 2001 BargainsGaloreStore All Rights Reserved This auction is for 8.5x14.5 #3 mailers ONLY!!! ***This size is not pictured above but is the SAME brand as those pictured Other sizes ARE available!!! For additional shipping supplies, simply visit my other Ebay Auctions!!!! ***** You may combine multiple auction wins***** *****to save on shipping fees!!***** Feel free to contact me for a price quote for your wins. E-mail me at parrothead88@microd.com Need your order RIGHT AWAY ?????? Visit our eBAY STORE for immediate purchase on ALL SHIPPING SUPPLIES!!! Click here for eBAY STORE ***** Payment ***** Paypal.com sent to parrothead88@microd.com ~~ OR ~~ Visa or Mastercard directly to our company 1-800-981-9064 ~~ OR ~~ Check or Money Order to: BargainsGaloreStore 8100 Brown Pelican Ave New Port Richey, FL 34653 *** CALL TOLL FREE *** *** 1-800-981-9064 *** FOR MORE INFORMATION .....OR..... TO PAY BY CREDIT CARD FOR YOUR WINNING BID WHEN AUCTION ENDS Our office hours are 8:00am to 10:00pm Eastern 7 DAYS A WEEK!!!! OVER 1 MILLION MAILERS IN STOCK!!!!! These are NAME BRAND~~~TOP QUALITY mailers!!! Try them once and you will be back for MORE!!!! ALL SELF-ADHESIVE!!! SATISFACTION GUARANTEED!!! 100% FULL REFUND!!! Please be sure to read my FEEDBACK FILE...... I am a reputable seller..... .....WITH A FEEDBACK RATING OVER 23,000!!!!! THANK YOU ALL FOR THE FEEDBACK!!!! MY PLEASURE TO SERVE YOU..... **** SHIPPING **** US mainland shipping will be $7 for the first 50 and $4 each additional 50 thereafter. Alaska and Hawaii MAY be more, depending on the size of the order. International orders welcome.......e mail me for shipping rates. Thank you so very much for your bid!!!!!! If you have any questions at all, please call.... *** 1-800-981-9064 *** ....or e mail me at.... parrothead88@microd.com BargainsGaloreStore 8100 Brown Pelican Ave New Port Richey, FL 34653 Thank You ebay Customers!!!! I would like to take a few minutes to THANK all of you who have been such loyal customers and Super EBAY customers!!!. It is truly MY PLEASURE serving you!!!! Other sellers may come and go but I am in this for the long haul!! GREAT prices may get you in the door but it is Fast, Honest, Friendly and Efficient service that keeps you coming back and referring SO many others to my products. I can't thank you enough!! I hope that when you are picking your vendor for this, or any other product, that you will look for the sellers with the proven service record and the feedback rating to back it up. With my feedback rating of well over 23,000 , you can rest assured that I will do everything in my power to bring you the best products, at the best prices possible and deliver it FAST FAST FAST!! Please feel free to call me anytime at 1-800-981-9064 to talk about my products or to just say HELLO!.....John Hannon (parrothead88) THANK YOU ALL FOR YOUR SUPPORT!!! eBay's most successful sellers use Auctionworks sales management services!"}, {"ItemID": "1043937480", "Name": "ENESCO MARY'S MOO MOOS COW COUPLE W BABY", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Enesco", "Mary's Moo Moos"], "Currently": "$9.98", "First_Bid": "$9.98", "Number_of_Bids": "0", "Bids": null, "Location": "FLORIDA", "Country": "USA", "Started": "Dec-04-01 19:11:42", "Ends": "Dec-14-01 19:11:42", "Seller": {"UserID": "joetsales", "Rating": "110"}, "Description": "ENESCO MARY'S MOO MOO COUPLE W BABY FIGURINE ..THIS PIECE IS A MUST FOR THE COLLECTOR OF M/M/M/ ..THIS PIECE IS FROM THE 1996 COLLECTION ..RETAIL IN 96 WAS $48 GET THIS CHERISHED PIECE FOR A LOT LESS ...5.95 FOR S & H GOOD LUCK!!!!!! Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1043987329", "Name": "Fantastic Four #79 NR paypal VG", "Category": ["Collectibles", "Pop Culture", "Comics", "Silver Age (1956-69)", "Superhero"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "I SHIP WORLD WIDE & ACCEPT PAYPAL!!!!!!!!!!!!", "Country": "USA", "Started": "Dec-04-01 20:03:58", "Ends": "Dec-14-01 20:03:58", "Seller": {"UserID": "ubese2@aol.com", "Rating": "704"}, "Description": "Here is a great comic. It is Fantastic Four #79. Comic is in VG condition or better (I always try to undergrade my comics). Comic has little wear along the spine and on the top of the comic. Comic has all its pages, pages are in great shape, staples are firm and rust free. Please check my other auctions for Silver Age X-Men and other Fantastic Four. Check in the future for Avnegers #1, Amazing Spider-man #1, and many other silver age books. I now accept paypal, cash, checks, and money orders and will ship world wide. Winner pays S&H of $4.00 (plus insurance based on final selling price, more if outside the US)."}, {"ItemID": "1044027229", "Name": "1955 Churchill Queen Elizabath Nehru photo", "Category": ["Collectibles", "Art, Animation & Photo Images", "Photographic Images", "Contemporary (1940-Now)", "Celebrity", "Other"], "Currently": "$9.99", "Buy_Price": "$51.72", "First_Bid": "$9.99", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "ienstine", "Rating": "844", "Location": "USA", "Country": "USA"}, "Time": "Dec-07-01 09:00:05", "Amount": "$9.99"}}], "Location": "Long Island, New York", "Country": "USA", "Started": "Dec-04-01 21:00:05", "Ends": "Dec-14-01 21:00:05", "Seller": {"UserID": "iconpix", "Rating": "1759"}, "Description": ".bgprimary { background-color:#FFCC00; } .bgsecondary { background-color:#FF6600; } .bgaccent { background-color:#00CC00; } .bgaccentlight { background-color:#CCFFCC; } HR { color:#00CC00; } .textColor { color:#FF6600; font-family: Verdana, helvetica, sans-serif;} .titledata{ color: #FFFFFF; font-family: Verdana, helvetica, sans-serif;} .description {font-family: verdana, sans-serif; color:#000000;} a.textLink { color:#FF6600;} ICONPIX vintage photos, negatives & more.... 1955 Churchill Queen Elizabath Nehru photo Click image to view larger version Vintage & original 7 x 9 \" sharp and glossy photo of Queen Elizabeth II with British Commonwealth Prime Ministers at Buckingham Palace. Mohammed Ali of Pakistan Robert G. Menzies of Australia Charles Swart of South Africa Sir Winston Church, Sidney Holland of New Zealand, Louis St. Laurent of Canada, Jawaharal Nehru of India, and Sir John Kotelawala of Ceylon. Still crisp in fine condition with little handling. Please ask questions before bidding and read these instructions . NO international or foreign bidders unless you agree to conduct our business via registered or overnight express mail Payment on all closed auctions should be received no later than between 7 to 10 days after closing. I DO NOT subscribe to PAY PAL or any other gadgets. I DO NOT use CHECKOUT. All members get PERSONALIZED attention and care as valued clients as they should get. Please read and inspect our FEEDBACKS from previous auctions. I GLADLY ACCEPT YOUR PERSONAL CHECK money order or Western Union Bid pay. Payment I accept the following forms of payment: Money Order, Personal Check. Additional Information Low cost image hosting and full service auction management solutions: AuctionWatch Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044042244", "Name": "ROY ROGERS COMICS # 76 1954 \"10 Cents\"", "Category": ["Collectibles", "Pop Culture", "Comics", "Golden Age (1938-55)", "Westerns"], "Currently": "$47.99", "First_Bid": "$14.99", "Number_of_Bids": "8", "Bids": [{"Bid": {"Bidder": {"UserID": "conman30@aol.com", "Rating": "1492", "Location": "MICHIGAN", "Country": "USA"}, "Time": "Dec-05-01 19:21:03", "Amount": "$19.12"}}, {"Bid": {"Bidder": {"UserID": "pcprintshop", "Rating": "6443", "Location": "Madawaska", "Country": "USA"}, "Time": "Dec-06-01 17:10:08", "Amount": "$23.24"}}, {"Bid": {"Bidder": {"UserID": "angiesfolly", "Rating": "738", "Location": "houston texas", "Country": "USA"}, "Time": "Dec-07-01 14:59:14", "Amount": "$27.37"}}, {"Bid": {"Bidder": {"UserID": "hackasaurus", "Rating": "574", "Location": "MIDWEST", "Country": "USA"}, "Time": "Dec-08-01 12:48:19", "Amount": "$31.49"}}, {"Bid": {"Bidder": {"UserID": "seaisle616", "Rating": "360", "Location": "Turnersville, NJ", "Country": "USA"}, "Time": "Dec-09-01 10:37:25", "Amount": "$35.62"}}, {"Bid": {"Bidder": {"UserID": "peapod48", "Rating": "911", "Location": "MN", "Country": "USA"}, "Time": "Dec-10-01 08:26:30", "Amount": "$39.74"}}, {"Bid": {"Bidder": {"UserID": "vthondaboi", "Rating": "7", "Location": "Dallas, Tx", "Country": "USA"}, "Time": "Dec-11-01 06:15:36", "Amount": "$43.86"}}, {"Bid": {"Bidder": {"UserID": "forsale@market121.com", "Rating": "3607", "Location": "FL", "Country": "USA"}, "Time": "Dec-12-01 04:04:41", "Amount": "$47.99"}}], "Location": "Tucson, AZ", "Country": "USA", "Started": "Dec-04-01 21:31:58", "Ends": "Dec-14-01 21:31:58", "Seller": {"UserID": "docnano", "Rating": "580"}, "Description": "ROY ROGERS COMICS WITH ROY AND TRIGGER ON COVER. FINE CONDITION. Vol.1 No. 76 April 1954. Please E-mail questions to docnano@aol.com. Payments are due within 7 days of auction closing. Winning bidder to pay $2.50 for US shipping and handling, outside US extra. US Funds only. Will accept Money Orders,Pay Pal or Personal Checks. Thanks For Looking, and Have FUN BIDDING! Ruby Lane Antiques & Collectibles"}, {"ItemID": "1044078197", "Name": "Set of 6 glass coasters w/characters", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Other Kitchenware"], "Currently": "$6.99", "First_Bid": "$6.99", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "bon69", "Rating": "722", "Location": "Tx", "Country": "USA"}, "Time": "Dec-07-01 12:09:14", "Amount": "$6.99"}}], "Location": "Creal Springs, IL", "Country": "USA", "Started": "Dec-05-01 00:09:14", "Ends": "Dec-15-01 00:09:14", "Seller": {"UserID": "djaap.shawneelink.net", "Rating": "89"}, "Description": "I am selling a set of 6 coasters with different characters on them. One is a ballerina with a pink and red dress. Another is a bartender with a big mustache mixing a drink. There is a man in his green pajamas (I think) holding his head with stars swimming around his head (possibly a headache). Next is a couple of drunks sitting by a lamppost. And the last two are the same of a dancer with a top hat sitting on a stool with a drink in his hand. These appear to be for a bar. I'm not sure how the ballerina fits into the picture. There is one other coaster that came with the set that is being listed seperately. It is a black man playing a saxaphone. If you are interested in it be sure to look at my auction. But note it will end a day earlier than this group. Also there is a coaster with no character that I will throw in if the winning bidder wants it. They need to let me know. These coasters are really, really cute. They are in great shape with no chips or cracks. The colors are very bright and nothing missing. There are some brown spots here and there, but you have to have them in good light to see the spots. I really believe the winning bidder is going to love them! There is no reserve. The buyer will be responsible for shipping charges and insurance if requested. I need to hear from you within 3 days after auction ends. Payment must be received within 10 days. I accept money orders, cashier checks, or personal checks that will need to clear. Don't forget to check out the other coaster! Thanks for looking and good luck bidding. E-mail if you have questions."}, {"ItemID": "1044100897", "Name": "BATMAN no 58 from 1950. Rare", "Category": ["Collectibles", "Pop Culture", "Comics", "Silver Age (1956-69)", "Superhero"], "Currently": "$60.00", "First_Bid": "$60.00", "Number_of_Bids": "0", "Bids": null, "Location": "near Seattle", "Country": "USA", "Started": "Dec-05-01 04:47:05", "Ends": "Dec-15-01 04:47:05", "Seller": {"UserID": "sea-bill", "Rating": "281"}, "Description": ".titledata { FONT-WEIGHT: bold; FONT-SIZE: 18px; COLOR: #000000; FONT-FAMILY: verdana, sans-serif } .description { COLOR: #000000; FONT-FAMILY: verdana, sans-serif } .link { FONT-FAMILY: verdana, sans-serif; underline: } HR { color: #000000; } BATMAN no 58 from 1950. Rare Click image to view larger version Here is a rarely seen copy of BATMAN NO 58 from 1950. the comic is only in Fair condition, cover is loose, and not complete. (See scan of item) But the comic itself is complete and in quite decent condition. Staples are still tight, though rusted. Pages are just starting to brown. Features three stories, main story is a Penguin caper (\"The Penguin's State-Bird Crimes\"). Winning bidder pays shipping. Insurance is optional. PayPal accepted. See my other comics for more Batman Low cost image hosting and full service auction management solutions: AuctionWatch Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044104207", "Name": "Classics Illustrated, No.162, 1961, (O), F/F-", "Category": ["Collectibles", "Pop Culture", "Comics", "Silver Age (1956-69)", "Classics Illustrated"], "Currently": "$17.50", "First_Bid": "$17.50", "Number_of_Bids": "0", "Bids": null, "Location": "Los Angeles, CA", "Country": "USA", "Started": "Dec-05-01 05:15:30", "Ends": "Dec-15-01 05:15:30", "Seller": {"UserID": "juriju@hotmail.com", "Rating": "202"}, "Description": "Classics Illustrated, No.162, ROBUR THE CONQUEROR, by Jules Verne, HRN 162, The Original, published by Gilberton Company Inc., in 1961, is in Fine/Fine- condition. the front cover looks Fine, very light edgewear around page showing. The Spine is in Fine- condition, light edgewear around bottom staple barely noticeable. The back cover is fine condition, very light age yellowing and the lightest of edgewear around page apparent. The interior pages are complete and in Very Fine condition, light age yellowing prevails throughout pages. Shipping is $3.50 priority mail, international shipping rates are higher. Click on a picture to enlarge ') //-- ') //-- Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044107651", "Name": "Vintage Anchor Hocking Salt & Pepper Shakers", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Salt, Pepper Shakers", "Range Sets"], "Currently": "$14.39", "First_Bid": "$3.00", "Number_of_Bids": "5", "Bids": [{"Bid": {"Bidder": {"UserID": "1548349", "Rating": "96", "Location": "BWI , Md.", "Country": "USA"}, "Time": "Dec-06-01 11:35:50", "Amount": "$5.28"}}, {"Bid": {"Bidder": {"UserID": "ilmomx2", "Rating": "769", "Location": "HAPPY HOLIDAYS......", "Country": "USA"}, "Time": "Dec-07-01 17:35:50", "Amount": "$7.56"}}, {"Bid": {"Bidder": {"UserID": "sean626", "Rating": "7", "Location": "Ship worldwide!", "Country": "Malaysia"}, "Time": "Dec-08-01 23:35:50", "Amount": "$9.83"}}, {"Bid": {"Bidder": {"UserID": "buyingout", "Rating": "84", "Location": "El Paso,TX", "Country": "USA"}, "Time": "Dec-10-01 05:35:50", "Amount": "$12.11"}}, {"Bid": {"Bidder": {"UserID": "batenburg37", "Rating": "469", "Location": "_", "Country": "Netherlands"}, "Time": "Dec-11-01 11:35:50", "Amount": "$14.39"}}], "Location": "Avon, MA 02322", "Country": "USA", "Started": "Dec-05-01 05:35:50", "Ends": "Dec-15-01 05:35:50", "Seller": {"UserID": "edsoldstuff", "Rating": "184"}, "Description": "~ ~ ~ ~ VIEW MY OTHER AUCTION ITEMS Vintage Anchor Hocking Salt & Pepper Shakers These s&p_s are in great shape. The glass is in excellent condition w/ no chips, cracks, or scratches. The lids are worn, as shown in photos. The glass is ribbed and they stand 4 __ tall. The cover reads on the sides as follows: 53-NKCT, Anchor Hocking, U.S.A.! I now accept PAYPAL!!!! Feel free to email me with any questions you may have or for additional photos @ cmekjian@mediaone.net. Free Honesty Counters powered by Andale! Payment Details U.S. Shipping and Handling $3.90 Shipping Insurance per item (optional) $1.10 Sales Tax (none) _ Learn more about checkout Payment Instructions I accept PAYPAL!!!...I also gladly accept personal checks and money orders. Shipping rate is via Priority and only if you live w/in the 48 states...*Insurance is optional* Thank you! Cheryl"}, {"ItemID": "1044123448", "Name": "Avon Church Mouse Bride and a Groom figurine", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Avon", "Decanters"], "Currently": "$9.00", "First_Bid": "$9.00", "Number_of_Bids": "0", "Bids": null, "Location": "NC", "Country": "USA", "Started": "Dec-05-01 06:59:33", "Ends": "Dec-15-01 06:59:33", "Seller": {"UserID": "msthrifty", "Rating": "745"}, "Description": "This Is an avon cologne decanter that is a Church Mouse Bride. It is 5\" tall and holds 2 fl. oz. of Delicate Daisies cologne. No date. In very good condition, no chips or cracks, and all most full of cologne. Top isn't centered just right so back of dress can show also. The groom is 4 1/2\" tall, and has a hook on his head and a silver string through it for hanging. He is new, and in very good condition. They are Clean,& smoke free. Buyer pays $4.50 for S&H in uSA. I accept paypal, bidpay, MO, and checks.THE SCAN CAST SHADOWS ON THE DRESS, BUT IT IS WHITE. hER HAT IS PINK, AND FLOWERS ARE PINK."}, {"ItemID": "1044154993", "Name": "1970's Large Plastic Santa Cookie Jar", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Cookie Jars", "Modern (1970-Now)"], "Currently": "$9.00", "First_Bid": "$9.00", "Number_of_Bids": "0", "Bids": null, "Location": "Pennsylvania", "Country": "USA", "Started": "Dec-05-01 09:01:01", "Ends": "Dec-15-01 09:01:01", "Seller": {"UserID": "yankeeladybugg", "Rating": "372"}, "Description": "1970's Large Plastic Santa Cookie Jar You are bidding on one large plastic Santa Cookie jar. This cookie jar was made in the mid-70's. Santa is 13\" high x 6 1/2\" wide. The cookie jar is made of plastic. Santa's hat is the lid. There are a few very small white spots where the paint has chipped on the lid. On the bottom of the cookie jar is the following information: Carolina Enterprises, Inc. 1973, an embossed logo for Empire, Made in the U.S.A., and #024288. Santa is in very good condition and is ready to come to your home for the holidays. Terms: PLEASE read this entire auction description prior to placing a bid. If you do not agree with any terms or conditions as stated below do not place a bid. Shipping to USA/FPO/APO addresses only. Money orders, cashier checks, or PayPal. Personal checks will be accepted. Checks must clear the bank prior to shipping. Pennsylvania residents add 7% state sales tax. (Shipping cost is taxable in Pennsylvania.) Shipping of $6.00 by Priority USPS to be paid by the bidder which includes delivery confirmation and insurance. Payment is to be received within five (5) days after the auction has ended. Please ask any questions you may have before placing a bid. Combine orders and save on shipping! There are no returns on merchandise. Items shipped will be the exact items which are pictured and described on the auction site. Great care has been taken to provide the best pictures and accurate descriptions for each item. Thank you for stopping by! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044160600", "Name": "Vintage American Family Scale Kitchen Scale", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Other Kitchenware"], "Currently": "$5.50", "First_Bid": "$5.50", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "circword@netscape.net", "Rating": "693", "Location": "buffalo, n.y.", "Country": "USA"}, "Time": "Dec-07-01 21:19:09", "Amount": "$5.50"}}], "Location": "CORVALLIS, OREGON", "Country": "USA", "Started": "Dec-05-01 09:19:09", "Ends": "Dec-15-01 09:19:09", "Seller": {"UserID": "dustknot", "Rating": "1522"}, "Description": "_ This auction presents this vintage, American Family Scale, kitchen scales. It has pictures of food on the face and this scales works! It measures 8 inches tall and is in good condition. This brings back memories! _ _ _ ***** _ _ ***** _ _ _ We ship Priority Mail immediately with money order payment; we ship Priority Mail with clearance of personal checks. _ This item can ship First Class for $6.45. _ (No PayPal!). _ Please put the item description and auction # on all correspondence. _ _ Dustknot offers used, vintage items that are sold _as is_. _ Dustknot is an Ebay PowerSeller and you are assured that the auctions are accurately represented by photos and text. _ Please ask your questions before bidding because auction sales are final. Auctions not paid for within 10 days will be voided and reposted. _ HAPPY BIDDING!"}, {"ItemID": "1044214000", "Name": "Lot of Eight Franklin Mint Plate Holders - NR", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Franklin Mint", "Other Franklin Mint Items"], "Currently": "$10.00", "First_Bid": "$10.00", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "26mimom", "Rating": "163", "Location": "Mount Vernon, VA", "Country": "USA"}, "Time": "Dec-07-01 23:41:12", "Amount": "$10.00"}}], "Location": "Tennessee", "Country": "USA", "Started": "Dec-05-01 11:41:12", "Ends": "Dec-15-01 11:41:12", "Seller": {"UserID": "vaness2604@aol.com", "Rating": "1378"}, "Description": "Lot of eight wooden plate holders for collectible Franklin Mint plates. The six larger holders measure approximately 11\" (outer diameter) and 8 1/2\" (inner diameter). One of the larger holders is cracked, but it is barely noticeable and still usable. The other five are in fair to good condition (minor scratches and nicks). The two smaller holders measure approximately 10\" (outer diameter) and 8 7/8\" (inner diameter). They are both in good condition and have a gold colored ring on the inner circle. These plate holders are fairly expensive through the company, but we are offering this lot of eight at NO RESERVE! Buyer is to pay for UPS Ground shipping. (Other shipping options are available, but will require a handling fee). We accept checks, money orders, Visa/MC and PayPal. ALL SALES ARE FINAL. Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044269494", "Name": "HALLMARK Keepsake Ornament 1990 Brass Bouquet", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Hallmark", "Miniature Ornaments"], "Currently": "$3.50", "First_Bid": "$3.50", "Number_of_Bids": "0", "Bids": null, "Location": "Oak Harbor, WA", "Country": "USA", "Started": "Dec-05-01 13:50:27", "Ends": "Dec-15-01 13:50:27", "Seller": {"UserID": "pflan1", "Rating": "758"}, "Description": "This is a Hallmark Heritage Christmas ornament. Sorry the photo may be blurry. These ornaments are in mint condition_never used_and in its original box. Pay quickly and I_ll do my best to get it to you well before Christmas. Thanks for looking and see many more of these in my other auctions on NOW. Shipping & Handling charges are $3.00. Insurance is additional at buyer_s option AND risk. Add $2.00 for Canadian OR add $5.00 for rest of world. If winning additional similar items, we must ask for $.75 each if we can ship together. We take VISA & MC thru PAYPAL, Cash, Checks or M.O. Personal Checks may be held 15 business days till clear. U.S. funds only within 10 DAYS. I_m a member of UACC so bid with confidence. 21 day no questions asked return policy of full bid price. C.O.A.s are guaranteed genuine forever for full bid price. Be sure to click above on SELLER_S OTHER AUCTIONS. Remember, the photo you see on eBay is ALWAYS worse than actual. Any other questions you may also call us at 360-240-8366 from 11 to 11 PST or Email ANYTIME to flan@whidbey.net"}, {"ItemID": "1044271868", "Name": "Julie Andrews THE SOUND OF MUSIC 1st Edition", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Knowles Collector Plates"], "Currently": "$9.99", "First_Bid": "$9.99", "Number_of_Bids": "0", "Bids": null, "Location": "cornerantiques.com", "Country": "USA", "Started": "Dec-05-01 13:55:53", "Ends": "Dec-15-01 13:55:53", "Seller": {"UserID": "www.cornerantiques.com", "Rating": "1514"}, "Description": "CornerAntiques eBay Template _ _ _ _ _ _ _ _ _ _ _ Julie Andrews \"THE SOUND OF MUSIC\" - 1986 Plate - 1st Edition - Bradex No. 84-K41-18.1 REAL AUCTION / NO RESERVE: As found - \"THE SOUND OF MUSIC\" 1st edition limited edition KNOWLES plate. Honors Richard Rodgers and Oscar Hammerstein II - in excellent overall condition - \"as issued\" - never displayed - measures about 8 1/2\" in diameter. Ignore any strange reflections or pixelation! You'll find that everytime you look at this plate you'll want to break out into song! Beware........ the neighbors will think you're on something stronger than Folgers. Look at other interesting collector plates we currently have listed. Combined orders save on shipping. please visit our other auctions @ eBay ID www.cornerantiques.com visit and bookmark our website www.cornerantiques.com TERMS OF AUCTION Corner Antiques will make every effort to faithfully describe each item to the best of our ability but not warrantied._ Please reference the included detailed photos and base your decision to bid solely on your knowledge and expertise._ Resolve any questions or concerns you before you bid._ ALL SALES FINAL . PAYMENT Buyer pays Shipping, Handling & Insurance in all transactions._ Payment due within ten (10) days of auction close. We appreciate Money Orders, PayPal & BidPay. PERSONAL CHECKS require 15 bank days to process - after arrival. INTERNATIONAL BUYERS:_ Use U.S. funds and expect HIGHER shipping costs. SHIPMENT Shipping quotes are based on \"PRIORITY\", \"GLOBAL\" and/or \"UPS\" rates - we reserve the right to modify shipping arrangements to facilitate and/or economize on OUR handling costs._ Buyer assumes all liability for any loss and/or damage if package is sent without insurance._ We ship the Friday following the confirmation of payment._ Exercise patience - Thank You. www.cornerantiques.com _"}, {"ItemID": "1044279832", "Name": "Eames Era Molded TEAK Plywood ICE BUCKET", "Category": ["Collectibles", "Housewares & Kitchenware", "Barware", "Ice Buckets"], "Currently": "$29.99", "First_Bid": "$29.99", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "acolytal", "Rating": "138", "Location": "X-ville", "Country": "USA"}, "Time": "Dec-08-01 02:13:37", "Amount": "$29.99"}}], "Location": "Los Angeles", "Country": "USA", "Started": "Dec-05-01 14:13:37", "Ends": "Dec-15-01 14:13:37", "Seller": {"UserID": "neonbl", "Rating": "1147"}, "Description": "Sleek streamlined Scandinavian mid-century modern styling highlights this wonderful (no breaks, chips, cracks, or damage) Eames Era Ice Bucket. Made from molded TEAK Plywood. It is a winner! Overall dimensions: 6_ top diameter, 6 _ _ tall. U.S. buyers pay $4.00 Priority Mail shipping. Use _Buy It Now_ and PayPal and get it by Christmas! We are eBay PowerSellers _ your satisfaction is guaranteed!"}, {"ItemID": "1044285284", "Name": "Ceramic Dad Mug - NIB Reasonably Priced!!", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Mugs"], "Currently": "$3.50", "First_Bid": "$3.50", "Number_of_Bids": "0", "Bids": null, "Location": "Scottsdale, Arizona, U.S.A.", "Country": "USA", "Started": "Dec-05-01 14:23:20", "Ends": "Dec-15-01 14:23:20", "Seller": {"UserID": "kathysnostalgia", "Rating": "1063"}, "Description": "if (navigator.appName == 'Microsoft Internet Explorer') { if (navigator.appVersion.substring(0,1) \"); } else { document.write(\" \"); document.write(\" \"); document.write(\" \"); document.write(\" BODY { background: url(http://www.thelegstersociety.com/blegtext.gif) }\"); document.write(\" \"); document.write(\" \"); } } else { //Default to Netscape settings. document.write(\" \"); } Stay Brave, Stay Free. DO NOT Let The Forces Of Evil Conquer Your RIGHT To Live FREE! Ceramic Dad Mug - NIB Reasonably Priced!! Kathy's Nostalgiabilia - Fine Nostalgia Items & Fine Women's Hosiery Since 1968 - Best Hosiery Values On eBay This listing consists of 1 ceramic DAD mug, with the inscription: \" You're Great At Everything, Especially Being A DAD.\" Brand new, and mint in original box. The perfect item to show appreciation for a hard-working, little-thanked dad!! Sometimes a little token goes a long way toward showing a dad he's special, needed and loved. Corny? Probably. REAL? Definitely! In a society where \"Cool Rules,\" REAL is the deal!! Bid now and let's get back to basics. NO Reserve, Low Opening Bid, Actual Priority Mail Shipping in the U.S., Actual AirMail to Europe and Canada. Usually NO RESERVE (unless otherwise noted), low opening bid, and Low Priced, Fast shipping. A quick word to our long time friends and customers as well as new: Other eBay dealers sell hose and other items, but not too many take the time to give you a good description and, perhaps, a little history, tips, etc...... We thank all of you who have taken the time to view, bid on and win our auctions! As always, we're happy to answer your questions about hosiery or any of our items. You can pay for this auction with: Money Order, Personal Check (will send you the item when it clears), With Your Visa Or MasterCard in the U.S. You Can Use PayPal. PayPal is now available around the world. Click on the PayPal logo below or visit them at: http://www.paypal.com, or, If You're An International Bidder, You Can Use Bid Pay To Send A Western Union Money Order In U.S. DOLLARS! They are at http://www.bidpay.com And now a quick word about our rules of the road. Please Take 2 Minutes To Read This And Avoid Delays Or Misunderstandings: 1.) Please Pay For Your Item Within 5 Days. If You're Having An Emergency Or A Problem, Let Us Know, We'll Work With You. Items not paid for in the specified time may be withheld from the non-paying bidder and may relisted. 2.) Non-paying Bidders Will Receive A Non-Paying Bidders Notice To eBay And Face Negative Feedback, And Ultimately Termination Of Their eBay Account If They Make A Habit Of Not Paying For Auctions. 3.) All Sales Final Unless Otherwise Marked So Please Ask Any Questions Before You Bid. 4.) If You Win More Than One Item Within 24 Hours, Please Be Sure To Let Us Know, So You Can Enjoy Combined Shipping And Save Money 5.) Please Include A Copy Of The Notification Letter With Your Payment For Fastest Service, Whether You Pay By PayPal Or Snail Mail. If You Don't Please Be Sure To Include The eBay Auction Number For Each Item, As Well As A Small Description Of Your Item(s) For The Fastest Service! 6.) Unlike A Majority Of Dealers On eBay We Leave You Feedback A.S.A.P. After Receiving Your Payment. We Would Appreciate Positive Feedback From You If You're Happy With Your Item When You Receive It. 7.) All Money Order or Check Payments MUST be drawn on a U.S. Bank, in U.S. Dollars. For example: A Money Order From The Royal Canadian Bank in U.S. Dollars is NOT accepted, not because we don't like Canadians, but because our bank imposes a hefty fee for such money orders. Canadian and European customers are encouraged to use PayPal or Bid Pay for payments. 8.) If you pay with PayPal and you have won multiple items, PLEASE make only 1 PayPal Payment and include all the auction numbers on the one payment. It simplifies it for you and for me. Also, PayPal charges a transaction fee for EACH payment made, in addition to their OTHER fees to the seller. We combine shipping to save you money - please combine multiple auction PayPal payments into ONE to help keep our costs low, so we can KEEP providing Lower Cost combined shipping.... A quick check of our feedback will show you that nearly every other buyer buys from us more than once!! Also, a larger percentage of our feedback centers on our FAST SHIPPING!!! Are you tired of paying for an item and waiting for 2 weeks? Not with Kathy's Nostalgiabilia. We get your money on Monday, and your item goes out by Wednesday or sooner if possible!! Our shipping rates are still among the best on eBay, even with the recent rise in rates in the Post Office. For up to 4 pairs of stockings: In the U.S $2.50; Canada: $2.75; Europe: $3.75. If you win other than hosiery items, Please See Listing For Actual Shipping Rate, or buyer is responsible for reasonable shipping rate. Believe me, ours are among the best shipping rates on eBay!! Our feedback profile is proof we deliver, however, we are not responsible for loss of goods in the mail that are not insured. Insurance is extra and based on total. Insured items go out once a week: Monday. Non-insured items go out a.s.a.p. upon receipt of payment. Kathy's Nostalgia Guarantees Every Item To Be As Described Or Your Money Back! Click here to view my other auctions. Arizona residents please add 7.25% sales tax. Thank you. Stay Brave, Stay Free. DO NOT Let The Forces Of Evil Conquer Your RIGHT To Live FREE! Created by eBay Seller's Assistant Pro"}, {"ItemID": "1044297318", "Name": "1977 Avon California Perfume Anniversary Talc", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Avon", "Other Avon Items"], "Currently": "$2.00", "First_Bid": "$2.00", "Number_of_Bids": "0", "Bids": null, "Location": "NW WI", "Country": "USA", "Started": "Dec-05-01 14:53:26", "Ends": "Dec-15-01 14:53:26", "Seller": {"UserID": "nsnrf4max", "Rating": "405"}, "Description": "This pretty talc tin is empty. It is from the California Perfume Co. 1997 Anniversary Keepsake line, named roses, roses. On the reverse of the tin is the story of David McConnell and how he started Avon. The tin is beginning to rust on the base and has some rust and scratches. This tin belonged to my sister for many years. I believe there is supposed to be a blue top to the tin, but it is gone. The top is rusting considerably, but it is still a pretty Avon memorabilia piece. Shipping and handling will be $2.20 for US sales. Please, no Paypal. Thanks for looking, and good luck! Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044300051", "Name": "FIRE KING CREAMER & SUGAR BOWL RAINBOW COLORS", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Other Kitchenware"], "Currently": "$1.25", "First_Bid": "$1.00", "Number_of_Bids": "2", "Bids": [{"Bid": {"Bidder": {"UserID": "pickford25", "Rating": "255", "Location": "ANIME PARADISE", "Country": "USA"}, "Time": "Dec-07-01 15:02:54", "Amount": "$1.12"}}, {"Bid": {"Bidder": {"UserID": "arlnwtkwsk@aol.com", "Rating": "61", "Location": "ARCADE, NEW YORK", "Country": "USA"}, "Time": "Dec-09-01 15:02:54", "Amount": "$1.25"}}], "Location": "MARION OHIO", "Country": "USA", "Started": "Dec-05-01 15:02:54", "Ends": "Dec-15-01 15:02:54", "Seller": {"UserID": "cjeworks", "Rating": "30"}, "Description": "THIS IS 2 VERY NICE PEICES OF FIRE KING. THE SET IS TRANLUCENT , BUT THE COLOR ON THEM ARE BEAUTIFUL. IT REMINDES ME OF RAINBOW COLORS. I HAVE 19 MORE VARIOUS PEICES TO PUT UP FOR AUCTION IF THESE SELL WELL. I ACCEPT PAYPAL & M/O ONLY. BUYER PAYS S/H OF $3.95"}, {"ItemID": "1044334640", "Name": "Martin Luther's Christmas Book Woodcuts", "Category": ["Collectibles", "Autographs, Paper & Writing", "Paper", "Ephemera"], "Currently": "$5.00", "First_Bid": "$5.00", "Number_of_Bids": "0", "Bids": null, "Location": "Newport County, RI", "Country": "USA", "Started": "Dec-05-01 16:23:34", "Ends": "Dec-15-01 16:23:34", "Seller": {"UserID": "buythebookri", "Rating": "876"}, "Description": "Martin Luther's Christmas Book Woodcuts Description Martin Luther's Christmas Book With Celebrated Woodcuts By His Contempories. Translated and Arranged by Roland H. Bainton. Published by Fortress Press Philadelphia. Copyright date 1983, eighth printing. 76 Paged, Soft covered in very good condition. {see photos} Payment and Shipping Our auctions are open ONLY to Registered eBay users within the United States. Please bid only if you intend to complete your transaction. Thank you for your co-operation. We accept the following methods of payment: Money Orders, Certified Checks, Personal Checks, credit cards through either Paypal.com or Bidpay.com. Please allow time for personal checks to clear (approx 7-10 business days); Master Card or Visa via PayPal (U.S. only) or send money order (also available through BidPay.com) or cashier's check for shipment within 24 hours. Sorry, no iescrow. Buyer to pay $3.75 shipping and handling for this item. Shipping method is by USPS Priority mail. Insurance is optional for a charge of $1.25 for every $50.00 worth of coverage. eBay's most successful sellers use Auctionworks sales management services!"}, {"ItemID": "1044348163", "Name": "famous monsters #41.nov,1966.almost perfect !", "Category": ["Collectibles", "Pop Culture", "Comics", "Magazines", "Other Magazines"], "Currently": "$32.50", "First_Bid": "$32.50", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "horst@cadvision.com", "Rating": "610", "Location": "Calgary, AB", "Country": "Canada"}, "Time": "Dec-08-01 04:48:03", "Amount": "$32.50"}}], "Location": "dutchess county", "Country": "USA", "Started": "Dec-05-01 16:48:03", "Ends": "Dec-15-01 16:48:03", "Seller": {"UserID": "fredkarger", "Rating": "332"}, "Description": "famous monsters #41.nov,1966.warren magazines.magazine is in splendid shape,just a shade short of looking like new...the spine looks like new..very strong...the front cover has a mirror surface to it that puts one in mind of a brand new book....the four corners have no warping, no pieces (of ANY size) cut off from the cover,and the blacks on the bottom are perfect....back cover is,again,near perfect...inside pages are white,no panels out,and no writing..no pieces missing or rips, anywhere. cant be 50 copies of this book in THIS condition in the world,left. SHIPPING ON this item will be 4.00....insurance, 1.50 extra. Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044361617", "Name": "Ultimate Spider-Man 1-7! TPB. MINT!", "Category": ["Collectibles", "Pop Culture", "Comics", "Modern Age (1980-Now)", "Superhero"], "Currently": "$41.00", "First_Bid": "$14.95", "Number_of_Bids": "2", "Bids": [{"Bid": {"Bidder": {"UserID": "teddy-n-erin", "Rating": "96", "Location": "Idaho", "Country": "USA"}, "Time": "Dec-07-01 17:10:40", "Amount": "$27.98"}}, {"Bid": {"Bidder": {"UserID": "aslkato@hotmail.com", "Rating": "175", "Location": "Rochester N.Y.", "Country": "USA"}, "Time": "Dec-09-01 17:10:40", "Amount": "$41.00"}}], "Location": "Santa Monica, CA", "Country": "USA", "Started": "Dec-05-01 17:10:40", "Ends": "Dec-15-01 17:10:40", "Seller": {"UserID": "hidehocomics", "Rating": "372"}, "Description": "Ultimate Spider-Man 1-7! TPB. MINT! _ Click to Enlarge Picture Product Description Ultimate Spider-Man \"Power & Responsibility\" this is the collection of the first 7 SOLD OUT issues! This is the first printing! Brand New & in MINT condition! Product Details Condition: Buyer pays shipping, credit cards accepted through PayPal & BidPay. Taxes apply where applicable. Thanks for looking! Quantity: 1 Transaction Details Payment Options: Visa, Mastercard, Discover, Debit, Check, Money Order & CASH! Comments: We always leave feedback! Please bid only if you intend to buy! We cater to your shipping needs: International, insurance and other shipping methods are accepted. Please let us know what you prefer so we can calculate your proper shipping total. See our ther Swell Stuff! Got a question? ASK! Create, post, track and manage your auctions with Invenna software. IAAP30 Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044363196", "Name": "ANRI Ferrandiz Ornament SET of FOUR MINT!", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "ANRI"], "Currently": "$39.00", "First_Bid": "$19.99", "Number_of_Bids": "6", "Bids": [{"Bid": {"Bidder": {"UserID": "outlawslady", "Rating": "120", "Location": "NEBRASKA-ALSO CHECK OUT MY OTHER AUCTIONS!!", "Country": "USA"}, "Time": "Dec-06-01 19:53:54", "Amount": "$23.16"}}, {"Bid": {"Bidder": {"UserID": "livlin", "Rating": "862", "Location": "Pennsylvania", "Country": "USA"}, "Time": "Dec-07-01 22:33:54", "Amount": "$26.33"}}, {"Bid": {"Bidder": {"UserID": "gldlcooley@aol.com", "Rating": "889", "Location": "Tulsa,Ok", "Country": "USA"}, "Time": "Dec-09-01 01:13:54", "Amount": "$29.49"}}, {"Bid": {"Bidder": {"UserID": "bkole18183", "Rating": "413", "Location": "Spring Mountain, Pa", "Country": "USA"}, "Time": "Dec-10-01 03:53:54", "Amount": "$32.66"}}, {"Bid": {"Bidder": {"UserID": "2lilboys", "Rating": "479", "Location": "BEST DRESSED KIDS", "Country": "USA"}, "Time": "Dec-11-01 06:33:54", "Amount": "$35.83"}}, {"Bid": {"Bidder": {"UserID": "en_rapture@hotmail.com", "Rating": "197", "Location": "Greenville TX", "Country": "USA"}, "Time": "Dec-12-01 09:13:54", "Amount": "$39.00"}}], "Location": "Save our wildlife in PA!", "Country": "USA", "Started": "Dec-05-01 17:13:54", "Ends": "Dec-15-01 17:13:54", "Seller": {"UserID": "emily-and-co", "Rating": "66"}, "Description": "This is a set of four lovely handcrafted and handpainted Toriart ornaments from Anri Ferrandiz. They come in their original plastic packages which have NEVER BEEN OPENED Set contains: girl with puppy dog on smiling moon, girl with acordian on smiling sun (Concertina), girl playing the flute on a sleeping star (Starshine), and girl playing the trumpet on a shooting star (Heavenly Melody). Would make for a very special gift for the holidays or great addition to your Anri collection. Please e-mail me with any questions whatsoever before bidding as I cannot accept returns. I have great feedback so you can bid with confidence. Only serious bidders please. Buyer pays $4.50 s/h by Priority Mail and insurance. Buyer must confirm winning bid and supply your shipping address within 3 days from close of auction. Payment to be received no later than 10 days after auction close. Preferred payment by money order, cashier's check or Paypal. I can also accept personal checks, but with a 10 day hold. Your bid confirms that you agree with these terms. I have other sets of ANRIs on auction and can combine shipping to save $$$, so please take a peek. Thanks and happy ebaying to you!"}, {"ItemID": "1044367519", "Name": "CGC 9.2 NM- MIGHTY HEROES #4, W/ MIGHTY MOUSE", "Category": ["Collectibles", "Pop Culture", "Comics", "Silver Age (1956-69)", "Superhero"], "Currently": "$115.00", "First_Bid": "$115.00", "Number_of_Bids": "0", "Bids": null, "Location": "Baltimore/D.C.", "Country": "USA", "Started": "Dec-05-01 17:19:55", "Ends": "Dec-15-01 17:19:55", "Seller": {"UserID": "diamondintlgal", "Rating": "50"}, "Description": "if (navigator.appName == 'Microsoft Internet Explorer') { if (navigator.appVersion.substring(0,1) \"); } else { document.write(\" \"); document.write(\" \"); document.write(\" \"); document.write(\" BODY { background: url(http://www.onceuponyourwedding.com/cindrblk.gif) }\"); document.write(\" \"); document.write(\" \"); } } else { //Default to Netscape settings. document.write(\" \"); } CGC 9.2 NM- MIGHTY HEROES #4, W/ MIGHTY MOUSE Diamond International Galleries eBay Listing for: THE MIGHTY HEROES #4 DELL PUBLISHING, 1967 CGC 9.2 NM- Here it comes to save your day! Another amazing offering from our incredible vault. Featuring everyone's favorite super rodent, Mighty Mouse! This cover is so vibrant, it must be seen in person to truly be appreciated. Put in your mighty bid for this mighty book mighty soon, it won't be around long! ~DIAMONDINTLGAL NO RESERVE CREDIT CARDS ARE ACCEPTED. PERSONAL CHECKS MUST CLEAR PRIOR TO SHIPPING. DON'T FORGET TO SEND US YOUR WANT LIST! CONTACT US TO BE PUT ON OUR E-MAILING LIST OF NEW AND UPCOMING AUCTIONS!! Buyer to pay $5.00 for shipping and handling. MD shipments must add 5% sales tax. SATISFACTION GUARANTEED! WE MUST BE INFORMED WITHIN 3 DAYS OF RECEIPT OF YOUR INTENTION TO RETURN AND BOOK MUST BE RETURNED IMMEDIATELY FOLLOWING. UPON VERIFICATION THAT THE BOOK IS IN THE SAME CONDITION AS WHEN WE SHIPPED IT OUT, A REFUND WILL BE GRANTED. WE SHIP UPS. Complimentary insurance. CHECK OUT OUR OTHER GREAT AUCTIONS! Click here to view my other auctions. This listing created by eBay Seller's Assistant Pro Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044387921", "Name": "ANTIQUE CLOCK CLOCKS*GILDED BRONZE CARTIER", "Category": ["Collectibles", "Furnishings, Knives & Tools", "Clocks", "Antique (Pre-1930)", "Shelf"], "Currently": "$795.00", "First_Bid": "$795.00", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "grucrew", "Rating": "3", "Location": "New Baltimore, MI", "Country": "USA"}, "Time": "Dec-08-01 05:51:26", "Amount": "$795.00"}}], "Location": "Bushnell,Il.", "Country": "USA", "Started": "Dec-05-01 17:51:26", "Ends": "Dec-15-01 17:51:26", "Seller": {"UserID": "colonel46", "Rating": "226"}, "Description": "*YOU ARE BIDDING ON A FINE GILDED BRONZE FRENCH PANTHER SIGNED CARTIER CLOCK * IT IS TITLED PANTHERE EN FURIE * IT IS SIGNED ON THE PANTHER * ON THE BACK OF THE CLOCK IT READS (PATENT MAKE FRANCE) (EDAILLE DOR 1900 PARIS)(SAMUEL MONETI)* THIS INFORMATION IS IN A CIRCLE ABOUT THE SIZE OF A DIME ON THE BACK OF THE CLOCK * THE PANTHER SITS ON A MINT MARBLE BASE * THE DIAL IS EXC. * THE CLOCK STRIKES ON A BELL ON THE HR. AND 1/2 HR.* COMES COMPLETE WITH THE KEY * IT IS A GIANT 19\"LONG AND 22\" TALL * I WILL SELL IT AS GILTED BRONZE IT WT. IS 37# * IT MAY OR MAY NOT NEED SERVICE AFTER S/H AND IS THEREFORE NOT GUARANTEED TO RUN * AS YOU KNOW CARTIER BUILT BEAUTIFUL CLOCKS * THIS IS NOT JUST A CLOCK IT IS A INVESTMENT * CK. OUR FEEDBACK AND BID ACCORDINGLY ON THIS FINE PC.WITH A VERY LOW MINIMUM AND A VERY REASONABLE RESERVE * * BUYER TO PAY IN FULL INC. S/H AND INS. * I WILL HAVE THIS CLOCK PROFESSIONALLY PACKED * PLAN ON $100.00 * BUYER WILL BE RESPONIBLE FOR FOLLOW UP CLAIM WITH INS. IN THE EVENT IT IS DAMAGED IN TRANSIT * YOU MAY PAY WITH A PER. CK. AND WAIT 10 DAYS FOR S/H OR WE WILL S/H SAME DAY WITH A M.O. Click on a picture to enlarge ') //-- Supersize Picture ') //-- Supersize Picture ') //-- Supersize Picture ') //-- Supersize Picture ') //-- Supersize Picture ') //-- Supersize Picture Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044389855", "Name": "CHRISTOPHER RADKO Trim A Tree O PIN 2 for1!!!", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Christopher Radko"], "Currently": "$4.99", "First_Bid": "$4.99", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "pink_flamingo_creations", "Rating": "21", "Location": "EASTERN WA", "Country": "USA"}, "Time": "Dec-08-01 05:54:27", "Amount": "$4.99"}}], "Location": "Royer", "Country": "USA", "Started": "Dec-05-01 17:54:27", "Ends": "Dec-15-01 17:54:27", "Seller": {"UserID": "saraly", "Rating": "1267"}, "Description": "Here are 2 beautiful Christopher Radko-Trim A Tree- PINS. They both are the same and have Santa in his sleigh with a little elf helping him load up the sleigh with presents. There is a Christmas tree in the background. It has glitter on it to give it just enough sparkle to make this pin stand out. You're going to love wearing this pin!! It measures 2 1/2\" long and 1 1/2\" wide and has a pin back. They are new, not used. You get 2 of the pins shown in the picture for one price, what a deal!! Shipping 4.00 Priority mail with delivery confirmation. Payment must be made within 10 days of close of auction to avoid a nonpayer alert from ebay. Money orders, bidpay, cashiers checks and paypal accepted. Thanks so much for bidding!! If using paypal, my email address is: pokey@uplink.net"}, {"ItemID": "1044392363", "Name": "DISNEY PINOCCHIO COOKIE JAR - NEW- MIB", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Cookie Jars", "Modern (1970-Now)"], "Currently": "$33.90", "Buy_Price": "$126.32", "First_Bid": "$33.90", "Number_of_Bids": "0", "Bids": null, "Location": "Northwest Suburbs", "Country": "USA", "Started": "Dec-05-01 17:58:13", "Ends": "Dec-15-01 17:58:13", "Seller": {"UserID": "osofine", "Rating": "256"}, "Description": "DISNEY PINOCCHIO COOKIE JAR - NEW- MIB This is Disney's newest Pinocchio cookie jar and it has captured the warmth between Pinocchio and his friend Jiminy Cricket. He is almost 12\" high and is new in his original packaging. Created by eBay Seller's Assistant Basic."}, {"ItemID": "1044407002", "Name": "LLADRO #7644: INNOCENCE in BLOOM (mint in box", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Lladro", "Figurines"], "Currently": "$199.99", "First_Bid": "$199.99", "Number_of_Bids": "0", "Bids": null, "Location": "LI/NY", "Country": "USA", "Started": "Dec-05-01 18:14:38", "Ends": "Dec-15-01 18:14:38", "Seller": {"UserID": "mitchelladro@aol.com", "Rating": "262"}, "Description": "LLADRO # 7644: INNOCENCE in BLOOM - from my own PERSONAL COLLECTION - is a MAGNIFICENT & MINT RETIRED LLadro porcelain figurine standing 9.50 inches tall. This figurine has the blue LLadro logo and flower on its base and comes in it's ORIGINAL LLadro box. It was first made in 1996 and was RETIRED in 1996, making it available for that one year only, as LLadro's Annual Club Figurine. It sells on the LLadro web sites for $350. NOTE: Each and every flower is perfect, hard to find this way - it is in PRISTINE condition. It's worth every bit of that price, it's a real gem. Win this auction and get it at a fraction of that cost. High bidder to pay by Postal Money Order and ADD $20 for fragile shipping and insurance. WILL BE MAILED IN TIME FOR THE HOLIDAYS + PLUS + FREE GIFT: EBAY ITEM # 1044400095, WILL BE YOURS FREE IF YOU ARE THE HIGH BIDDER ON THIS AUCTION. Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044412792", "Name": "18 Old pt fruit jars, glass lids&wire closure", "Category": ["Collectibles", "Housewares & Kitchenware", "Bottles: Antique (Pre-1900)", "Fruit Jars"], "Currently": "$15.50", "Buy_Price": "$34.29", "First_Bid": "$1.00", "Number_of_Bids": "7", "Bids": [{"Bid": {"Bidder": {"UserID": "alliemay@ctaz.com", "Rating": "694", "Location": "Bullhead City, AZ", "Country": "USA"}, "Time": "Dec-06-01 18:21:35", "Amount": "$3.07"}}, {"Bid": {"Bidder": {"UserID": "resolved", "Rating": "350", "Location": "Rivercity, Nebr", "Country": "USA"}, "Time": "Dec-07-01 18:21:35", "Amount": "$5.14"}}, {"Bid": {"Bidder": {"UserID": "ballteam222", "Rating": "16", "Location": "EVANSVILLE IN", "Country": "USA"}, "Time": "Dec-08-01 18:21:35", "Amount": "$7.21"}}, {"Bid": {"Bidder": {"UserID": "wrobb", "Rating": "611", "Location": "Omaha., Ne.", "Country": "USA"}, "Time": "Dec-09-01 18:21:35", "Amount": "$9.29"}}, {"Bid": {"Bidder": {"UserID": "pro-one", "Rating": "1000", "Location": "La Jolla, CA", "Country": "USA"}, "Time": "Dec-10-01 18:21:35", "Amount": "$11.36"}}, {"Bid": {"Bidder": {"UserID": "jakethesnake1965", "Rating": "894", "Location": "Southeast USA", "Country": "USA"}, "Time": "Dec-11-01 18:21:35", "Amount": "$13.43"}}, {"Bid": {"Bidder": {"UserID": "maureendietz", "Rating": "385", "Location": "Former Tupperware Lady cleans in Iowa !", "Country": "USA"}, "Time": "Dec-12-01 18:21:35", "Amount": "$15.50"}}], "Location": "FRANKFORT, IN", "Country": "USA", "Started": "Dec-05-01 18:21:35", "Ends": "Dec-15-01 18:21:35", "Seller": {"UserID": "mwire", "Rating": "7226"}, "Description": "YOU GET 18 OLD PINT CLEAR GLASS CANNING JARS WITH GLASS LIDS AND WIRE CLOSURE FOR ONE PRICE this equals one lot. I THINK ALL OF THESE ARE BALL AND ATLAS. buyer pays $15.50 shipping in continental U.S. all others pay quoted shipping to their location, this includes APO's. We do not ship thru USPS. Please see all our other deals for dealers. CLICK ON SELLER'S OTHER AUCTIONS. **18-#373reg** Free Honesty Counters powered by Andale! Visit Mathews Wire Inc today! Payment Details U.S. Shipping and Handling $15.50 Shipping Insurance per item - Sales Tax (none) _ Learn more about checkout Payment Instructions Satisfaction guaranteed."}, {"ItemID": "1044417566", "Name": "unread Wolverine miniseries #1-3", "Category": ["Collectibles", "Pop Culture", "Comics", "Collections"], "Currently": "$13.00", "First_Bid": "$13.00", "Number_of_Bids": "1", "Bids": [{"Bid": {"Bidder": {"UserID": "mirabonita", "Rating": "147", "Location": "Land of Enchantment", "Country": "USA"}, "Time": "Dec-09-01 18:31:00", "Amount": "$13.00"}}], "Location": "R.C.", "Country": "USA", "Started": "Dec-05-01 18:31:00", "Ends": "Dec-15-01 18:31:00", "Seller": {"UserID": "krpkid", "Rating": "226"}, "Description": "These are all unread. Wolverine miniseries #1-#3(the #3s were in a box w/ too much weight & have some small spine creases from the backboards bending a little). I have sold about 25 sets of these & everyone has been pleased. You can save on shipping by combining auctions. I am selling a complete run of Justice League of America #92 up for 1 cent this week, so please check my other auctions to save on shipping. Bulk listing tools, image hosting, counters, auction management and more at AuctionWatch Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044429906", "Name": "1967 March Boris Karloff #17 March Gold Key", "Category": ["Collectibles", "Pop Culture", "Comics", "Silver Age (1956-69)", "Horror, Sci-Fi"], "Currently": "$3.05", "First_Bid": "$3.05", "Number_of_Bids": "0", "Bids": null, "Location": "Spring, Texas", "Country": "USA", "Started": "Dec-05-01 18:43:41", "Ends": "Dec-15-01 18:43:41", "Seller": {"UserID": "2000more", "Rating": "1"}, "Description": "Very solid comic, no missing or loose pages, no folded page corners, minimal handling evidence, colors good inside and out, slight age browning at the page extremes. Has pinup/poster back page. Buyer pays $1.95 for First Class shipping and handling to any destination in the USA and I will always combine multiple wins to get the best possible shipping rate. Insured shipping is optional but reasonable (starts at under a dollar and goes up depending on the value of the item, fragility of the item, etc.) I accept just about any kind of payment: All major credit cards are accepted directly and without fees: Visa, MasterCard, Discover and American Express. I also accept Money Orders, Personal Checks, Business Checks, Cashier Checks and even straight Wampum. And of course, I honor basically all the payment services: Billpoint, PayPal, BidPay and PayDirect, with PayPal being perhaps the most convenient for both Buyer and Seller. My personal preference, though, is plain old checks and Money Orders. That may seem a little old fashioned, but online payment services are actually quite costly. Did you know that in most cases the Seller winds up paying PayPal and Billpoint more than the amount paid to eBay in Final Value Fees? Believe me, that's a fact. Online payment services are very convenient but they do drive up the costs for Sellers, so eventually this winds up costing all of us a little bit more. Please feel free to contact me directly via email at LindaGHTX@aol.com I Guarantee Total Satisfaction -- if you are unhappy with your purchase for any reason just return the item and I will refund all you've paid plus reimburse you for return shipping. Simple. I accept PayPal payments! Now Available for International Users Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044448350", "Name": "FREARM #1 MALIBU COMICS COMIC BOOK NR", "Category": ["Collectibles", "Pop Culture", "Comics", "Modern Age (1980-Now)", "Alternative, Underground"], "Currently": "$1.50", "First_Bid": "$1.50", "Number_of_Bids": "0", "Bids": null, "Location": "Lafayette CA", "Country": "USA", "Started": "Dec-05-01 19:02:12", "Ends": "Dec-15-01 19:02:12", "Seller": {"UserID": "bigpix", "Rating": "794"}, "Description": "FREARM #1 MALIBU COMICS COMIC BOOK NR Click picture to enlarge Description: Condition: NM, Guide Price : $2.25 1st appearance Firearm; 1st appearance of Firearm; Stories: American Pastimes, Part 1 ; James Robinson story; Cully Hamner art Includes information from ComicBase _ and _ 2001 Human Computing. All comics are bagged and backed, handled lovingly in a non-smoking home. The white label is on the bag, not the comic itself. View my other auctions Use the REAL selling tools a million sellers do - Andale! If you are the winning bidder, please read the following instructions: If you are the winning bidder, please use my fast, easy, and secure checkout. Click the checkout button on the right. Enter your shipping address and other information so I can calculate a final price and ship your product quickly. andale andalecheckout Winning bidder: Click button to go to my fast, easy, & secure Checkout Fixed Shipping Charges.$2.00 (Domestic) $3.00 (International) Will Ship Internationally I accept: - Money Orders/Cashier's Checks - Personal Checks I have a satisfaction guaranteed policy. If you are not happy for any reason, you can return it for a full refund. Personal Checks: Items paid by check will be held for 10 days. Money Orders: Please e-mail me if you are sending a check or money order so I can know the money is coming. My address is: Ann Daman The Big Picture Movie Posters 3663 Crescent Drive Lafayette CA 94549 PayPal: My preferred method for receiving payments is PayPal. PayPal is a service that allows you to instantly send money to anyone with an email address. PayPal is used by over 6 million members in 26 countries worldwide, and PayPal is accepted on a majority of all eBay auctions. PayPal is completely free for US buyers to send money, and PayPal lets you charge the payment to either your credit card or checking account. About The Big Picture Movie Posters The Big Picture Movie Posters The Big Picture Movie Posters offers a variety of original movie posters, one-sheets, press kits, lobby cards, buttons, vinyl banners, standees and miscellaneous movie theater tie-ins and memorabilia"}, {"ItemID": "1044458000", "Name": "department 56 ceramic santa claus", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Dept 56", "Other Dept 56 Items"], "Currently": "$24.00", "First_Bid": "$24.00", "Number_of_Bids": "0", "Bids": null, "Location": "its a dry heat", "Country": "USA", "Started": "Dec-05-01 19:10:12", "Ends": "Dec-15-01 19:10:12", "Seller": {"UserID": "rulabula", "Rating": "1035"}, "Description": "beautiful well cared for santa claus from department 56. this charming santa claus stands approximately 14_ tall and is 9_ wide. the piece has a matte finish that is not glossy and he carries a belt full on jingle bells. this piece would go nicely with the snowman and christmas tree which are all up for auction right now. PLEASE READ CAREFULLY!!!! payment by cashier's check, money order, or personal check. personal checks must clear before shipping. the hold period will be a minimum of 14 days. I ship with UPS and the buyer is responsible for shipping charges. the shipping rate is dependent on both the weight of the package and the distance that package will travel. the minimum shipping/handling charge is $6 and will increase with distance and weight. shipment will occur within 2 to 5 days after the deposit of funds. a $2 surcharge will apply for all USPS shipments if you cannot have or do not want ups service. If you are in need of rush shipping, please let me know and I_will furnish quotes on availability. the BUY-IT-NOW price includes free domestic shipping (international winners and residents of alaska and hawaii receive a credit of like value applied towards their total) and, as an added convenience, you can pay with paypal if you utilize the feature. paypal is not accepted if you win the auction during the course of the regular bidding-I only accept paypal if the buy it now feature is utilized. thank you for your understanding and good luck! Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044517180", "Name": "Buick street sign,Great gift idea!", "Category": ["Collectibles", "Advertising", "Cars", "American", "Buick"], "Currently": "$9.95", "Buy_Price": "$20.97", "First_Bid": "$9.95", "Number_of_Bids": "0", "Bids": null, "Location": "Tulsa, OK", "Country": "USA", "Started": "Dec-05-01 20:19:42", "Ends": "Dec-31-01 20:19:42", "Seller": {"UserID": "stickerman@edgeonesigns.com", "Rating": "2145"}, "Description": ".titledata { font-family: verdana, sans-serif; font-size:17px; color:#00000; font-weight : bold; } .description { font-family: verdana, sans-serif; color:#636145; background-color : #ffffff; } .link { font-family: verdana, sans-serif; font-size:12px; underline; } HR { color: #000000; } Buick street sign,Great gift idea! New Page 1 This auction is for a 6\" x 24\" alum. sign Green and White T hese signs are great for dens, garages, kids bedrooms, driveways, just about anywhere. They also make great gifts alum. will not rust like steel therefore it will last for many years outdoors all signs will ship within two days of payment Please look at my other custom sign auctions stickerman@edgeonesigns.com shipping is a set price of 4.95 I will accept paypal, money order or cashiers check If you have any questions, please email me! Happy bidding! Payment I accept the following forms of payment: PayPal, Money Order. Low cost image hosting and full service auction management solutions: AuctionWatch Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044520426", "Name": "CIRCUS COPPER COOKIE CUTTER MINT SET", "Category": ["Collectibles", "Housewares & Kitchenware", "Kitchenware", "Cookie Cutters"], "Currently": "$36.00", "Buy_Price": "$97.01", "First_Bid": "$9.99", "Number_of_Bids": "7", "Bids": [{"Bid": {"Bidder": {"UserID": "ursapooh_at_yahoo_dot_com", "Rating": "100", "Location": "DOUGLASVILLE GA US", "Country": "USA"}, "Time": "Dec-06-01 20:25:46", "Amount": "$13.71"}}, {"Bid": {"Bidder": {"UserID": "Antonios", "Rating": "145", "Location": "Stanford, CA", "Country": "USA"}, "Time": "Dec-07-01 20:25:46", "Amount": "$17.42"}}, {"Bid": {"Bidder": {"UserID": "bomormon", "Rating": "85", "Location": "St. Amant, LA", "Country": "USA"}, "Time": "Dec-08-01 20:25:46", "Amount": "$21.14"}}, {"Bid": {"Bidder": {"UserID": "zippy4234", "Rating": "247", "Location": "MICHIGAN", "Country": "USA"}, "Time": "Dec-09-01 20:25:46", "Amount": "$24.85"}}, {"Bid": {"Bidder": {"UserID": "nyhunt212@aol.com", "Rating": "16079", "Location": "Copake Falls, NY", "Country": "USA"}, "Time": "Dec-10-01 20:25:46", "Amount": "$28.57"}}, {"Bid": {"Bidder": {"UserID": "dreamdresser", "Rating": "440", "Location": "Los Angeles, CA", "Country": "USA"}, "Time": "Dec-11-01 20:25:46", "Amount": "$32.28"}}, {"Bid": {"Bidder": {"UserID": "anjin549", "Rating": "48", "Location": "Landing, NJ", "Country": "USA"}, "Time": "Dec-12-01 20:25:46", "Amount": "$36.00"}}], "Location": "Folsom, CA", "Country": "USA", "Started": "Dec-05-01 20:25:46", "Ends": "Dec-15-01 20:25:46", "Seller": {"UserID": "landon777", "Rating": "1110"}, "Description": "I AM OFFERING THIS SET OF 9 COPPER COOKIE CUTTERS WITH A CIRCUS THEME MINT IN THE ORIGINAL BOX WITH WOOD SHAVINGS. IT ALSO COMES WITH THE WILLIAM SONOMA COOKIE RECIPES AND INSTRUCTIONS BOOK. THIS WAS AN EXPENSIVE SET FROM WILLIAM SONOMA AND BY ALL MEANS IS IN MINT CONDITION, PERFECT FOR A GIFT. BUYER PAYS SHIPPING & HANDLING OF $6.00. Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1044521948", "Name": "1981 Hallmark Family Tree Ornament - MINT", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Hallmark", "Ornaments"], "Currently": "$6.99", "First_Bid": "$6.99", "Number_of_Bids": "0", "Bids": null, "Location": "Ocean County, NJ", "Country": "USA", "Started": "Dec-05-01 20:31:00", "Ends": "Dec-15-01 20:31:00", "Seller": {"UserID": "711jmj", "Rating": "431"}, "Description": "This auction is for a 1981 Family Tree Photoholder ornament # QX515-3. It is Beautiful, it is in the shape of a Christmas tree and the photo goes in the middle. It has never been used, it is mint. The box in good condition with the following exceptions. The box has no price tag, There us a small rip on the front left bottom side adn a smaller one the same side top. There is a small crease on the right side. Any other questions please emailme *BEFORE* auction ends. Winning bidder to pay shipping and insurance, within 7 days of auctions end. Payment is accpeted in theofrom of Paypal, BIDPay or US $ MOney order only. NO PERSONAL CHECKS. Free Honesty Counters powered by Andale! Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1048723305", "Category": ["Collectibles", "Pop Culture", "Comics", "Bronze Age (1970-79)", "Superhero"], "Ends": "Dec-21-01 17:59:03", "First_Bid": "$1.00", "Name": "AMAZING SPIDER-MAN ANNUAL 12 1978 VF+++", "Started": "Dec-14-01 17:59:03", "Country": "USA", "Number_of_Bids": "0", "Currently": "$1.00", "Bids": null, "Seller": {"Rating": "307", "UserID": "bluesugarmonkey"}, "Location": "new york", "Description": "This is it! The last week I'll be listing books on ebay until after the new year. check daily for new listings, all $1.00 & no reserve. Thanks. This auction is for Amazing spider-Man Annual 12 from 1978 in VERY FINE+++. Spider-Man vs the Hulk! Reprints issues 119 & 120 of Amazing Spider-man. A great high grade copy. I accept Paypal & postal money orders only. Shipping for this book is $3.50 priority. Insurance is optional, add $1.10. NO INTERNATIONAL BIDDERS PLEASE! Non paying bidders will receive negative feedback. Thanks & as always, HAVE FUN!!! Free Honesty Counters powered by Andale! Payment Details U.S. Shipping and Handling $3.50 Shipping Insurance per item (optional) $1.10 Sales Tax (0.000% if shipped to none) _ Learn more about checkout Payment Instructions See item description or contact seller for more information."}, {"ItemID": "1048723313", "Category": ["Collectibles", "Decorative & Holiday", "Decorative by Brand", "Enesco", "Precious Moments"], "Ends": "Dec-21-01 17:59:16", "First_Bid": "$2.50", "Name": "Precious Moments-February Piggy Bank", "Started": "Dec-14-01 17:59:16", "Country": "USA", "Number_of_Bids": "0", "Currently": "$2.50", "Bids": null, "Seller": {"Rating": "1542", "UserID": "gully7"}, "Location": "Alta Iowa", "Description": "February Piggy Bank by Precious Moments. Hind end reads Enesco designed giftware Japan Precious Moments 1988 Samuel J. Butcher All Rights Reserved worldwide Licensee Enesco Imports Corp. Sticker Enesco intact on pig. 3 1/2 X 2 1/2. Excellent condition. Shipping is $4.00 Payment Details See item description and Payment Instructions, or contact seller for more information. Payment Instructions See item description or contact seller for more information."}]}
